iarsystems/ewarm-st-example-projects/STM32F7xx/IAR-STM32F746xx-SK/TempSensor/app/iosys.c
/*************************************************************************
 *
 *    Used with ICCARM and AARM.
 *
 *    (c) Copyright IAR Systems 2015
 *
 *    File name   : iosys.c
 *    Description : printf helper functions
 *
 *    History :
 *    1. Date        : JUne, 2015
 *       Author      : Atanas Uzunov
 *       Description : Create
 *
 **************************************************************************/
#include <yfuns.h>
#include "stm32f7xx.h"
#include "iar_stm32f746xx_sk.h"

extern UART_HandleTypeDef UartHandle;

/*************************************************************************
 * Function Name: MyLowLevelGetchar
 * Parameters: none
 *
 * Return: int
 *
 * Description:
 *
 *************************************************************************/
static int MyLowLevelGetchar(void)
{
int ch;
unsigned int status = COM1_BASE->ISR;

  if(status & UART_FLAG_RXNE)
  {
    ch = UartHandle.Instance->RDR;
    if(status & (UART_FLAG_ORE | UART_FLAG_PE | UART_FLAG_FE) )
    {
      return (ch | 0x10000000);
    }
    return (ch & 0xff );
  }
  return -1;
}

/*************************************************************************
 * Function Name: __write
 * Parameters: int Handle, const unsigned char * Buf, size_t Bufsize
 *
 * Return: size_t
 *
 * Description: Low Level character output
 *
 *************************************************************************/
size_t __write(int Handle, const unsigned char * Buf, size_t Bufsize)
{
  if (HAL_UART_Transmit(&UartHandle, (uint8_t *)Buf, Bufsize, 0xFFFFFFFF) == HAL_OK)
    return Bufsize;
  else
    return 0;
}

/*************************************************************************
 * Function Name: __read
 * Parameters: int handle, unsigned char * buffer, size_t size
 *
 * Return: size_t
 *
 * Description: Low Level character input
 *
 *************************************************************************/
size_t __read(int handle, unsigned char * buffer, size_t size)
{
  int nChars = 0;

  /* This template only reads from "standard in", for all other file
   * handles it returns failure. */
  if (handle != _LLIO_STDIN)
  {
    return _LLIO_ERROR;
  }

  for (/* Empty */; size > 0; --size)
  {
    int c = MyLowLevelGetchar();
    if (c < 0)
      break;

    *buffer++ = c;
    ++nChars;
  }

  return nChars;
}
